
## Plan Result (prod_dns)




<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * cloudflare_dns_record.records[&#34;hass.heimelska.co.uk&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # cloudflare_dns_record.records["hass.heimelska.co.uk"] will be created
  + resource "cloudflare_dns_record" "records" {
      + content          = (sensitive value)
      + created_on       = (known after apply)
      + id               = (known after apply)
      + meta             = (known after apply)
      + modified_on      = (known after apply)
      + name             = "hass.heimelska.co.uk"
      + proxiable        = (known after apply)
      + proxied          = true
      + settings         = (known after apply)
      + tags             = (known after apply)
      + tags_modified_on = (known after apply)
      + ttl              = 1
      + type             = "CNAME"
      + zone_id          = (sensitive value)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":829,"Program":"tfcmt","SHA1":"","Target":"prod_dns","Vars":{}} -->